//-------------------------------------------------
//功能: 不用库，在学习板上实现1个LED闪烁
//版本号：v0.0.0
//编写： 孙冬梅
//日期： 20120229
//-------------------------------------------------
#include <stm32f10x.h> 	 

void Delay(unsigned int t);	

////////////////////////////////////////////////////////////////////////////////////
//-------------------------------------------------
//主程序
//------------------------------------------------- 
main()
{  
	RCC -> APB2ENR = 1 << 5;//1左移5位 《微控制器手册》P71   IOPDEN：IO端口D时钟使能 (I/O port D clock enable) 位5 由软件置’1’或清’0’ 0：IO端口D时钟关闭； 1：IO端口D时钟开启。
	GPIOD -> CRL = 2 << 8;  //2左移8位(D口) 《微控制器手册》P113 00：通用推挽输出模式 10：输出模式，最大速度2MHz
	while(1)
	{
		GPIOD ->BSRR = 1 << 2;
		Delay(500000); 		
		GPIOD ->BRR  = 1 << 2;  
		Delay(500000); 
	}
}

//-------------------------------------------------
//延时
//-------------------------------------------------
void Delay(unsigned int t)
{ 
	while(t--) ;	
}
